import mmap, struct, os, sys
from time import gmtime, strftime
import LinuxMemory as linux
import AddressSpaceARM as arm
# debian_x64
# lububntu_x64
offset = [
    (0, 1208, 655360),
    (655360, 656568, 65536),
    (786432, 722104, 536084480),
    (4244635648, 536806584, 16777216),
    (4294705152, 553583800, 262144)
]
# 4.11 4.15 4.16 4.19 4.20
# centos 8 
offset2 = [ 
    (0, 400, 816),
    (0, 1216, 655360),
    (655360, 656576, 65536),
    (786432, 722112, 536084480),
    (4244635648, 536806592, 16777216),
    (4294705152, 553583808, 262144)
]
# cenos7
offset3 = [
    (0, 400, 816),
    (0, 1216, 655360),
    (655360, 656576, 65536),
    (786432, 722112, 133431296),
    (4244635648, 134153408, 16777216),
    (4294705152, 150930624, 262144)
]
#centos6
offset4 = [
    (0, 344, 816),
    (0, 1160, 655360),
    (786432, 656520, 267649024),
    (4244635648, 268305544, 16777216),
    (4294705152, 285082760, 262144)
]
# lede-4.4.50
# openwrt
offset5 = [
    (0, 344, 816),
    (0, 1160, 655360),
    (786432, 656520, 133431296),
    (4244635648, 134087816, 16777216),
    (4294705152, 150865032, 262144)
]
#goldfish
offset6 = [
    (0, 344, 816),
    (0, 1160, 655360),
    (786432, 656520, 267649024),
    (4244635648, 268305544, 16777216),
    (4294705152, 285082760, 262144)
]
#arm goldfish
offset7 = [
    (0, 284, 134217728)
]
#arm64
offset8 = [
    (1073741824, 2096, 268435456)
]
#runs (1073741824, 2096, 268435456)

#5.3_2048
#4.18_2048
offset9 = [
    (0, 1216, 655360),
    (655360, 656576, 65536),
    (786432, 722112, 2146697216),
    (4244635648, 2147419328, 16777216),
    (4294705152, 2164196544, 262144)
]
#4.18_1024/53/411
offset10 = [
    (0, 1216, 655360),
    (655360, 656576, 65536),
    (786432, 722112, 1072955392),
    (4244635648, 1073677504, 16777216),
    (4294705152, 1090454720, 262144)
]

class AddressSpace(linux.AMD64PagedMemory):
#class AddressSpace(linux.ArmAddressSpace):
    def __init__(self, mem_path, dtb = 0, verbose = 1):
        try:
            f = os.open(mem_path, os.O_RDONLY)
        except:
            print "Error: open image failed.\n"
            sys.exit(1)

        try:
            self.mem = mmap.mmap(f, 0, mmap.MAP_PRIVATE, mmap.PROT_READ)
        except:
            print "Error mmap\n"
            sys.exit(1)
        self.verbose = verbose
        #offset: debian_x64 lububntu_x64
        #offset2: lubuntu20 centos8 4.11 4.12 4.13 4.14 4.15 4.16 4.18 4.19 4.20 5.3    
        #offset3: cenos7
        #offset4: centos6
        self.offset = offset2
        self.mem_path = mem_path
        self.mem.seek(0)
       
        if "ELF" in self.mem.read(6):
            print "ELF headers"
            self.has_elf_header = True
            self.offset = self.parse_elf_header()


        else:
            print "No ELF headers"
            self.has_elf_header = False
        # Identify Linux version
        version_idx = self.mem.find("Linux version") + len("Linux version ")
        if version_idx:
            self.mem.seek(version_idx)
            version = self.mem.read(8)
            v = version[:version.index('-')]
            if len(v) >= 7:
                self.version = v[:-3]
            else:
                self.version = v[:-2]
            print "Linux version", float(self.version)
        else:
            print "[Error] - cannot identify Linux version"
            self.version = 0
        #self.find_KASLR_shift("kallsyms_on_each_symbol")
        vdtb_idx = self.mem.find("SYMBOL(swapper_pg_dir)=") + len("SYMBOL(swapper_pg_dir)=")
        if vdtb_idx-len("SYMBOL(swapper_pg_dir)=")>0:
            self.mem.seek(vdtb_idx)
            dtb_vaddr = "0x" + self.mem.read(16)
            print "dtb_vaddr", dtb_vaddr
        else:
            print "cannot find dtb_vaddr"
            dtb_vaddr = "0xffffffffaee0a000"
        #self.find_kallsyms_address_pre_46_arm()
        self.image_name = os.path.basename(mem_path)
        store_dtb = "./" + self.image_name + "_dtb"
        g_dtb = 0
        '''
        try: 
            with open(store_dtb, 'r') as fd:
                g_dtb = fd.readline()
                #print "--", g_dtb
                if g_dtb:
                    g_dtb = int(g_dtb)
                else:
                    g_dtb = None
        except IOError:
            g_dtb = None
        
        if not g_dtb:
            try: 
                with open(self.image_name + "_symbol_table", 'r') as fd:
                    line = fd.readline()
                    while line:
                        symbol_name = ["swapper_pg_dir", "init_level4_pgt", "init_top_pgt"]
                        if any(c in line for c in symbol_name):
                            g_dtb = int(line[:line.find('\t')][:-1], 16)
                            if dtb_vaddr:
                                self.shift = int(dtb_vaddr, 16) - g_dtb
                                print "shift", hex(self.shift)
                            else:
                                self.shift = 0
                        if " init_task" in line:
                            init_task_vaddr = int(line[:line.find('\t')][:-1], 16)
                        line = fd.readline()
            except IOError:
                g_dtb = None
            if g_dtb:
                print "try dtb"
                g_dtb = self.try_dtb(g_dtb, dtb_vaddr)
            self.dtb_vaddr = dtb_vaddr
            self.dtb = dtb
        if dtb:
            self.dtb = dtb
        elif g_dtb:
            print "get dtb", g_dtb
            self.dtb = g_dtb
            with open(store_dtb, 'w') as fd:
                fd.write(str(self.dtb))
        else:
            pass
            #self.find_dtb(0x1a000000)
            
            self.find_dtb(0x1000000)
            # There is another page table when searchingfrom 0x0. but not complete.
            #self.find_dtb(0x0)
            with open(store_dtb, 'w') as fd:
                fd.write(str(self.dtb))
        #self.find_dtb(0)
        '''

    def parse_elf_header(self):
        '''
            Parse elf header 64 
        '''
        #elf64_header definition from Volatility
        elf64_header = {
            'e_ident' : [ 0, ['String', dict(length = 16)]], 
            'e_type' : [ 16, ['Enumeration', dict(target = 'unsigned short', choices = {
                0: 'ET_NONE', 
                1: 'ET_REL', 
                2: 'ET_EXEC', 
                3: 'ET_DYN', 
                4: 'ET_CORE', 
                0xff00: 'ET_LOPROC', 
                0xffff: 'ET_HIPROC'})]],
            'e_machine' : [ 18, ['unsigned short']], 
            'e_version' : [ 20, ['unsigned int']], 
            'e_entry' : [ 24, ['unsigned long long']], 
            'e_phoff' : [ 32, ['unsigned long long']], 
            'e_shoff' : [ 40, ['unsigned long long']], 
            'e_flags' : [ 48, ['unsigned int']], 
            'e_ehsize'    : [ 52, ['unsigned short']], 
            'e_phentsize' : [ 54, ['unsigned short']], 
            'e_phnum'     : [ 56, ['unsigned short']], 
            'e_shentsize' : [ 58, ['unsigned short']], 
            'e_shnum'     : [ 60, ['unsigned short']], 
            'e_shstrndx'  : [ 62, ['unsigned short']],
        }
        elf64_pheader = {
            'p_type' : [ 0, ['Enumeration', dict(target = 'unsigned int', choices = {
                0: 'PT_NULL', 
                1: 'PT_LOAD',
                2: 'PT_DYNAMIC', 
                3: 'PT_INTERP', 
                4: 'PT_NOTE', 
                5: 'PT_SHLIB', 
                6: 'PT_PHDR', 
                7: 'PT_TLS', 
                0x60000000: 'PT_LOOS', 
                0x6fffffff: 'PT_HIOS', 
                0x70000000: 'PT_LOPROC', 
                0x7fffffff: 'PT_HIPROC'})]],
            'p_flags' : [ 4, ['unsigned int']], 
            'p_offset' : [ 8, ['unsigned long long']], 
            'p_vaddr' : [ 16, ['unsigned long long']], 
            'p_paddr' : [ 24, ['unsigned long long']], 
            'p_filesz' : [ 32, ['unsigned long long']], 
            'p_memsz' : [ 40, ['unsigned long long']], 
            'p_align' : [ 48, ['unsigned long long']], 
        }
        header_size = 56
        e_phoff = self._read_memory(elf64_header['e_phoff'][0], 2)
        e_phnum = self._read_memory(elf64_header['e_phnum'][0], 2)
        runs = []
        for i in range(e_phnum):
            idx = i * header_size
            p_paddr = self._read_memory(e_phoff + idx + elf64_pheader['p_paddr'][0], 4)
            p_offset = self._read_memory(e_phoff + idx + elf64_pheader['p_offset'][0], 4)
            p_memsz = self._read_memory(e_phoff + idx + elf64_pheader['p_memsz'][0], 4)
            runs.append((int(p_paddr), int(p_offset), int(p_memsz)))

        #for item in runs:
        #    print item

        return runs




    def parse_system_map(self, path):
        with open(path, 'r') as system_map:
            sysmap = system_map.read()
            init_task_idx = sysmap.find(" init_task")
            init_task_from_system_map = "0x" + sysmap[init_task_idx-18:init_task_idx-2]

            init_top_pgt_idx = sysmap.find(" init_top_pgt")
            if init_top_pgt_idx < 0:
                init_top_pgt_idx = sysmap.find(" init_level4_pgt")
            if init_top_pgt_idx < 0:
                print "[-] Error: cannot find init_pgt form System.map"
            init_top_pgt_from_system_map = "0x" + sysmap[init_top_pgt_idx-18:init_top_pgt_idx-2]

        self.init_task_from_system_map = init_task_from_system_map
        self.init_top_pgt_from_system_map = init_top_pgt_from_system_map
        
        print "[-] init_task_from_system_map: {}, init_top_pgt_from_system_map: {}".format(init_task_from_system_map, init_top_pgt_from_system_map)


    def log(self, message):
        print('%s\t%s' %(strftime("%Y-%m-%d %H:%M:%S", gmtime()), message))
        sys.stdout.flush()

    def translate(self, addr):
        for input_addr, output_addr, length in self.offset:
            if addr >= input_addr and addr < input_addr + length:
                return output_addr + (addr - input_addr)
            if addr < input_addr:
                return None

        return None
    def _read_memory(self, paddr, length):
        '''
            This function is for reading elf header
        '''
        if paddr > 1024:
            print "Error: This function is for reading elf header."
            sys.exit(1)
        self.mem.seek(paddr)
        value = self.mem.read(length)
        if not value:
            print "Error: fail to read memory at", hex(paddr)
            sys.exit(1)
        if length == 2:
            value = struct.unpack('<H', value)[0]
        elif length == 4:
            value = struct.unpack('<I', value)[0]

        return value

    def read_memory(self, paddr, length):
        # Comment out for testing

        if self.has_elf_header :
            paddr = self.translate(paddr)
            if not paddr:
                #print "Error: translate failed.\n"
                return None
                #sys.exit(1)
        
        if self.mem.size() - paddr < length:
            print "Error: read out of bound memory.", hex(paddr), hex(self.mem.size())
            sys.exit(1)

        self.mem.seek(paddr)
        value = self.mem.read(length)
        if not value:
            print "Error: fail to read memory at", hex(paddr)
            sys.exit(1)
        return value

    def try_dtb(self, dtb, dtb_vaddr):
        tmp_dtb = 0
        for step in range(0, self.mem.size(), 4096):
            if self.maybe_vtop(dtb_vaddr, step) == step:
                print "try dtb", hex(step)
                break
        return step

    def find_dtb(self, start_addr = 0x3809000):
        '''
        This method generates a list of pages that are
        available within the address space. The entries in
        are composed of the virtual address of the page
        and the size of the particular page (address, size).
        It walks the 0x1000/0x8 (0x200) entries in each Page Map,
        Page Directory, and Page Table to determine which pages
